/*
 * Обєкти (робимо плейлист музики: імя, рейтинг, треки, кількість треків)
 * - Літерал обєкта
 * - Ввластивість, ключі (імя) і значення
 * - Як відрізнити обєкт від області видимостф
 */

/*
 * Доступ до влвстивості
 * - obj.key
 * - obj['key']
 * - Властивості яких немає
 */

/*
 * Короткий запис влвстивостей
 */
const username = 'Mango';
const email = 'mango@mail.com';

const signupData = {};

/*
 * Властивості які вичисляються
 */

//  <input name="color" value="tomato" >

const inputName = 'color';
const inputValue = 'tomato';

const colorPickerData = {};

/*
 * Як добавити в обєкт ключі
 */

/*
 * Ссилочний тип {} === {}
 */

/*
 * Масиви і функції це обєкти
 */
